#+TITLE: @@latex: Introduction to OS-Level Virtualization on Linux@@
#+AUTHOR:    @@latex: \vspace{-2em}@@ \footnotesize Pedro Bruel \newline \scriptsize \emph{phrb@ime.usp.br}
#+EMAIL:     phrb@ime.usp.br
#+DATE:      \scriptsize May 25th, 2020
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:t toc:nil @:t \n:nil ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   tex:t latex:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_FILE_NAME: os-level-virtualization-linux.pdf
#+LINK_UP:
#+LINK_HOME:

#+STARTUP: beamer
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [10pt, compress, aspectratio=169, xcolor={table,usenames,dvipsnames}]
#+LATEX_HEADER: \mode<beamer>{\usetheme[numbering=fraction, progressbar=none, titleformat=smallcaps, sectionpage=none]{metropolis}}

#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+LATEX_HEADER: \usepackage{sourcecodepro}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage{array}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{multirow}
#+LATEX_HEADER: \usepackage{caption}
#+LATEX_HEADER: \usepackage{xeCJK}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \usepackage[scale=2]{ccicons}
#+LATEX_HEADER: \usepackage{hyperref}
# #+LATEX_HEADER: \usepackage{url}
#+LATEX_HEADER: \usepackage{relsize}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{bm}
#+LATEX_HEADER: \usepackage{wasysym}
#+LATEX_HEADER: \usepackage{ragged2e}
#+LATEX_HEADER: \usepackage{textcomp}
#+LATEX_HEADER: \usepackage{pgfplots}
#+LATEX_HEADER: \usepgfplotslibrary{dateplot}
#+LATEX_HEADER: \definecolor{Base}{HTML}{191F26}
# #+LATEX_HEADER: \definecolor{Accent}{HTML}{157FFF}
#+LATEX_HEADER: \definecolor{Accent}{HTML}{bb0300}
#+LATEX_HEADER: \setbeamercolor{alerted text}{fg=Accent}
#+LATEX_HEADER: \setbeamercolor{frametitle}{fg=Base,bg=White}
*** Script
    #+begin_SRC bash :results output :session *shell* :eval no-export :exports code :tangle "src/virtualization_cgroups/launch_alpine_container.sh"
    CGROUP_ID="MAC0475-145"
    sudo cgcreate -g "cpu,cpuacct,memory:$CGROUP_ID"
    sudo cgset -r cpu.shares=512 "$CGROUP_ID"
    sudo cgset -r memory.limit_in_bytes=10000000000 "$CGROUP_ID"
    #+end_SRC

    #+RESULTS:
    : CGROUP_ID="MAC0475-145"   CGROUP_ID=[33m"[33mM[33mA[33mC[33m0[33m4[33m7[33m5[33m-[33m1[33m4[33m5[33m"[39m[?2004l
    : I% [?2004hI% sudo cgcreate -g "cpu,cpuacct,memory:$CGROUP_ID"   [32ms[32mu[32md[32mo[39m [32mc[32mg[32mc[32mr[32me[32ma[32mt[32me[39m -g [33m"[33mc[33mp[33mu[33m,[33mc[33mp[33mu[33ma[33mc[33mc[33mt[33m,[33mm[33me[33mm[33mo[33mr[33my[33m:[33m$[33mC[33mG[33mR[33mO[33mU[33mP[33m_[33mI[33mD[39m[33m"[39m[?2004l
    : [sudo] password for phrb:
    : CGROUP_ID"
    : I% [?2004hI% sudo cgset -r cpu.shares=512 "$CGROUP_ID"   [32ms[32mu[32md[32mo[39m [32mc[32mg[32ms[32me[32mt[39m -r cpu.shares=512 [33m"[33m$[33mC[33mG[33mR[33mO[33mU[33mP[33m_[33mI[33mD[39m[33m"[39m[?2004l
    : CGROUP_ID"
    : I% [?2004hI% sudo cgset -r memory.limit_in_bytes=10000000000 "$CGROUP_ID"   [32ms[32mu[32md[32mo[39m [32mc[32mg[32ms[32me[32mt[39m -r memory.limit_in_bytes=10000000000 [33m"[33m$[33mC[33mG[33mR[33mO[33mU[33mP[33m_[33mI[33mD[39m[33m"[39m[?2004l

*** Script                                                          :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
    #+begin_SRC bash :results output :session *shell* :eval no-export :exports code :tangle "src/virtualization_cgroups/launch_alpine_container.sh"
    HOSTNAME="alpine-container"
    sudo cgexec -g "cpu,cpuacct,memory:$CGROUP_ID" \
         unshare -fmuipn --mount-proc \
         chroot "$IMG_DIR/" \
         /bin/sh -c "PATH=/bin && mount -t proc proc /proc && hostname $HOSTNAME && sh"

    #+end_SRC

    #+RESULTS:
    : HOSTNAME="alpine-container"   HOSTNAME=[33m"[33ma[33ml[33mp[33mi[33mn[33me[33m-[33mc[33mo[33mn[33mt[33ma[33mi[33mn[33me[33mr[33m"[39m[?2004l
    : I% [?2004hI% sudo cgexec -g "cpu,cpuacct,memory:$CGROUP_ID" \   [32ms[32mu[32md[32mo[39m [32mc[32mg[32me[32mx[32me[32mc[39m -g [33m"[33mc[33mp[33mu[33m,[33mc[33mp[33mu[33ma[33mc[33mc[33mt[33m,[33mm[33me[33mm[33mo[33mr[33my[33m:[33m$[33mC[33mG[33mR[33mO[33mU[33mP[33m_[33mI[33mD[39m[33m"[39m \[?2004l
    : [?2004h>      unshare -fmuipn --mount-proc \[?2004l
    : [?2004h>      chroot "$IMG_DIR/" \[33m"[33m$[33mI[33mM[33mG[33m_[33mD[33mI[33mR[39m[33m/[33m"[39m \[?2004l
    : [?2004h>      /bin/sh -c "PATH=/bin && mount -t proc proc /proc && hostname $HOSTNAME && sh"       /bin/sh -c [33m"[33mP[33mA[33mT[33mH[33m=[33m/[33mb[33mi[33mn[33m [33m&[33m&[33m [33mm[33mo[33mu[33mn[33mt[33m [33m-[33mt[33m [33mp[33mr[33mo[33mc[33m [33mp[33mr[33mo[33mc[33m [33m/[33mp[33mr[33mo[33mc[33m [33m&[33m&[33m [33mh[33mo[33ms[33mt[33mn[33ma[33mm[33me[33m [33m$[33mH[33mO[33mS[33mT[33mN[33mA[33mM[33mE[39m[33m [33m&[33m&[33m [33ms[33mh[33m"[39m[?2004l

    And some *cleanup* after:

    #+begin_SRC bash :results output :session *shell* :eval no-export :exports code :tangle "src/virtualization_cgroups/launch_alpine_container.sh"
    sudo cgdelete cpu,cpuacct,memory:/$CGROUP_ID
    #+end_SRC

    #+RESULTS:
    :
    : CGROUP_ID[?2004l
    : cgdelete: cannot remove group '/MAC0475-145': No such file or directory


*** Reproducing the Alpine Container                                :B_block:
    :PROPERTIES:
    :BEAMER_act: <3>
    :BEAMER_env: block
    :END:
    #+begin_SRC bash :results output :session *shell* :eval no-export :exports code :tangle ./src/docker_alpine/docker_alpine.sh
    #! /bin/bash

    sudo docker image pull alpine
    sudo docker container run -it --memory=10g --cpu-shares=512 alpine
    #+end_SRC

    #+RESULTS:
    : sudo docker image pull alpine   [32ms[32mu[32md[32mo[39m [32md[32mo[32mc[32mk[32me[32mr[39m image pull alpine[?2004l
    : [sudo] password for phrb:
    : Using default tag: latest
    : latest: Pulling from library/alpine
    : Digest: sha256:9a839e63dad54c3a6d1834e29692c8492d93f90c59c978c1ed79109ea4fb9a54
    : Status: Image is up to date for alpine:latest
    : docker.io/library/alpine:latest
    : ]0;~/cloud/presentations/org/linux-containersI% [?2004hI% sudo docker container run -it --memory=10g --cpu-shares=512 alpine   [32ms[32mu[32md[32mo[39m [32md[32mo[32mc[32mk[32me[32mr[39m container run -it --memory=10g --cpu-shares=512 alpine[?2004l

